import hashlib
import random
import string

# Сопоставление стандартных символов шестнадцатеричного алфавита с кибертронскими
cyber_alphabet = {
    '0': '⩀', '1': '⩁', '2': '⩂', '3': '⩃', '4': '⩄', '5': '⩅', '6': '⩆', 
    '7': '⩇', '8': '⩈', '9': '⩉', 'a': '⩊', 'b': '⩋', 'c': '⩌', 'd': '⩍', 
    'e': '⩎', 'f': '⩏','а': '⨀', 'б': '⩐', 'в': '⩓', 'г': '⨁', 'д': '⩔', 'е': '⩖', 'ё': '⩗', 
    'ж': '⨂', 'з': '⩘', 'и': '⩙', 'й': '⨃', 'к': '⩚', 'л': '⨄', 'м': '⨅', 
    'н': '⩛', 'о': '⨆', 'п': '⩜', 'р': '⨇', 'с': '⩝', 'т': '⨈', 'у': '⩞', 
    'ф': '⨉', 'х': '⩟', 'ц': '⨊', 'ч': '⩠', 'ш': '⨋', 'щ': '⩡', 'ъ': '⨌', 
    'ы': '⩢', 'ь': '⨍', 'э': '⩣', 'ю': '⨎', 'я': '⩤'
}

# Функция создания кибертронского хэша
def cybertron_hash(data):
    # Генерируем стандартный SHA-512 хэш
    standard_hash = hashlib.sha512(data.encode('utf-8')).hexdigest()
    
    # Преобразуем его в кибертронский стиль
    cyber_hash = ''.join(cyber_alphabet[char] for char in standard_hash)
    return cyber_hash

# Пример использования
data = '[{90}]'
cyber_hashed = cybertron_hash(data)

print("Входные данные:", data)
print("Кибертронский хэш:", cyber_hashed)
